{
  "profileDetails": {
    "name": "NIRAJ DUWAL",
    "email": "duwalkneerose@gmail.com",
    "description": "👋 Hi! I'm Niraj, an electronics engineer with a passion for coding. I've honed my programming skills through a blend of structured learning and self-teaching. Let's combine innovation with coding, and user-centric design.",
    "hobby": "During my downtime, you'll find me singing 🎤, diving into books 📕, exploring modern trends 🚀, gaming, and enjoying the company of my favorite people ❤️.",
    "hobbyImage1": "https://kneerose.github.io/bucket/portfolio/images/about1.png",
    "hobbyImage2": "https://kneerose.github.io/bucket/portfolio/images/about2.png",
    "cv": "https://drive.google.com/uc?export=download&id=1iJoO_JCLYwoz--M4N1I-bMbjICkTldwd",
    "avatar": "https://kneerose.github.io/bucket/portfolio/images/me.png"
  },
  "socialProviders": [
    {
      "name": "Linkedin",
      "logo": "https://kneerose.github.io/bucket/portfolio/images/socialProviderLogo/linkedin.png",
      "link": "https://www.linkedin.com/in/niraj-duwal-82537b187/"
    },
    {
      "name": "GitHub",
      "logo": "https://kneerose.github.io/bucket/portfolio/images/socialProviderLogo/GitHub.png",
      "link": "https://github.com/kneerose"
    },
    {
      "name": "Reddit",
      "logo": "https://kneerose.github.io/bucket/portfolio/images/socialProviderLogo/reddit.png",
      "link": "https://www.reddit.com/user/kneerose143"
    },
    {
      "name": "Instagram",
      "logo": "https://kneerose.github.io/bucket/portfolio/images/socialProviderLogo/instagram.png",
      "link": "https://www.instagram.com/niraj.duwal/"
    },
    {
      "name": "Smule",
      "logo": "https://kneerose.github.io/bucket/portfolio/images/socialProviderLogo/smule.png",
      "link": "https://www.smule.com/kneerose12"
    }
  ],
  "quotesDetails": {
    "quotes": "Great web design without functionality is like a sports car with no engine.",
    "owner": "Paul Cookson"
  },
  "personalities": {
    "title": "I am INTP-T",
    "description": "Characterized by a strong analytical mind, a creative approach to problem-solving, and a continuous drive for self-improvement.",
    "references": "According to 16personalities.com",
    "image": "https://kneerose.github.io/bucket/portfolio/images/16personal.png"
  },
  "products": [
    {
      "title": "bettercollected",
      "link": "https://bettercollected.com/",
      "description": "A privacy-focused form builder designed for conscious companies that prioritize the rights and data privacy of their form responders.",
      "role": "Fullstack developer",
      "backgroundColor": "#E8F2FF",
      "image": "https://kneerose.github.io/bucket/portfolio/images/bettercollected.png"
    },
    {
      "title": "Sireto",
      "link": "https://sireto.com/",
      "description": "Sireto is a software company based on the Netherlands and Nepal building innovative software and solutions for our partners and valued clients.",
      "role": "Fullstack developer",
      "backgroundColor": "#FDF2FF",
      "image": "https://kneerose.github.io/bucket/portfolio/images/sireto.png"
    },
    {
      "title": "Kuber IDE",
      "link": "https://kuberide.com/",
      "description": "PreSetup Environment for writing and trying out plutus contracts and cardano transactions.",
      "role": "Ghost theme developer",
      "backgroundColor": "#F4F4F6",
      "image": "https://kneerose.github.io/bucket/portfolio/images/KuberIDE.png"
    }
  ],
  "testimonials": [
    {
      "thought": "Niraj has a remarkable ability to grasp complex concepts quickly and delivered outstanding solutions that exceeded expectations. I wholeheartedly endorse Niraj's expertise and look forward to collaborating again.",
      "name": "Michael Johnson",
      "position": "CTO, InnovateHub",
      "image": "https://kneerose.github.io/bucket/portfolio/images/testimonialImage1.png"
    },
    {
      "thought": "Niraj is a disciplined guy who delivered the assigned tasks within the deadline with a fantastic result. I highly recommend Niraj as a software Developer and would love to work together again.",
      "name": "Sandip pandey",
      "position": "CEO, Sireto technology",
      "image": "https://kneerose.github.io/bucket/portfolio/images/testimonialImage.png"
    },
    {
      "thought": "Niraj's attention to detail and problem-solving skills are exemplary. His dedication and innovative approach significantly contributed to the project's success. I enthusiastically recommend Niraj for his software development prowess.",
      "name": "Emily Walker",
      "position": "VP of Engineering, TechRevolution",
      "image": "https://kneerose.github.io/bucket/portfolio/images/testimonialImage2.png"
    }
  ],
  "facts": [
    "Software developers are known for their adeptness with keyboard shortcuts, utilizing them extensively to navigate through code editors and increase productivity.",
    "It's a stereotype, but many developers have a fondness for coffee, often associating it with long hours of coding and problem-solving.",
    "A significant number of developers code as a hobby or side project, working on personal coding challenges, open-source contributions, or passion projects outside of their regular job.",
    "Software development has been at the forefront of remote work culture, with many developers embracing the flexibility to work from anywhere, even before it became more widespread in other industries.",
    "Developers frequently visit Stack Overflow, a popular Q&A platform, to seek solutions, troubleshoot code, and learn from fellow developers' experiences.",
    "Developer communities often share programming-related memes and jokes, reflecting a shared sense of humor about coding challenges and tech-related situations.",
    "Developers emphasize continual learning, often attending workshops, conferences, and online courses to stay updated with the latest programming languages, tools, and methodologies.",
    "Developers enjoy solving complex puzzles, and many developers find coding akin to solving intricate problems, relishing the mental challenges it presents.",
    "Proficiency in version control systems like Git is ingrained in developer workflow, allowing them to track changes, collaborate efficiently, and maintain codebase integrity.",
    "Software developers come from various academic backgrounds, with some having degrees in computer science, engineering, mathematics, or even transitioning from entirely different fields due to a passion for programming.",
    "Developers often use a technique called \"rubber duck debugging,\" where they explain their code problem to an inanimate object (like a rubber duck) to help clarify their thinking and find solutions.",
    "Many developers, regardless of their experience, suffer from imposter syndrome, feeling like they don't belong or aren't skilled enough despite their competence and achievements.",
    "Developers frequently participate in hackathons, where they collaborate intensively on creative coding projects within a short timeframe, fostering innovation and camaraderie within the community.",
    "A significant number of developers actively contribute to open-source projects, sharing code, fixing bugs, and collaborating with other developers worldwide.",
    "Developers engage in various online communities and forums like GitHub, Reddit (e.g., r/programming), and Discord servers dedicated to programming, exchanging ideas, and seeking advice.",
    "Developers value code reviews as a means of improving code quality, learning from peers, and ensuring best practices are followed within a team or community.",
    "Some developers enjoy pair programming, a practice where two programmers work together on the same code, providing real-time feedback and improving code quality.",
    " Developers sometimes include hidden messages, jokes, or Easter eggs in their code for fun, which might only be discovered by those who read through the code.",
    "Many developers prefer using the terminal and command line tools for their efficiency and flexibility in managing projects and executing tasks.",
    "Developers embrace CI/CD practices to automate building, testing, and deploying code changes, ensuring faster and more reliable software delivery."
  ]
}